#include "stm32f10x.h"

/*
// 变长指令，结束符^，起始符始终有效
// 起始符%
// 地址标识符TTT
+-----------------------------------------------------------------------------------------------------+
|   Operator    |  SubOperator  |     Operand     |      Return      |            Function            |
+-----------------------------------------------------------------------------------------------------+
|      A        |       S       |   temperature   |        DDD       |  Set Temperature of ExtruderA  |
|-----------------------------------------------------------------------------------------------------|
|      A        |       G       |                 |    temperature   |  Get Temperature of ExtruderA  |
|-----------------------------------------------------------------------------------------------------|
|      A        |       T       |                 |    temperature   |    Get TSetting of ExtruderA   |
|-----------------------------------------------------------------------------------------------------|
|      A        |       C       |   coolerpower   |        DDD       |  Set CoolerPower of ExtruderA  |
|-----------------------------------------------------------------------------------------------------|
|      B        |       S       |   temperature   |        DDD       |  Set Temperature of ExtruderB  |
|-----------------------------------------------------------------------------------------------------|
|      B        |       G       |                 |    temperature   |  Get Temperature of ExtruderB  |
|-----------------------------------------------------------------------------------------------------|
|      B        |       C       |   coolerpower   |        DDD       |  Set CoolerPower of ExtruderB  |
|-----------------------------------------------------------------------------------------------------|
|      G        |       S       |   temperature   |        DDD       |  Set Temperature of BasePlane  |
|-----------------------------------------------------------------------------------------------------|
|      G        |       G       |                 |    temperature   |  Get Temperature of BasePlane  |
|-----------------------------------------------------------------------------------------------------|
|      G        |       E       |                 |    temperature   | Get Temperature of Environment |
|-----------------------------------------------------------------------------------------------------|
|      T        |       *       |                 |        DDD       |      Communication Test        |
+-----------------------------------------------------------------------------------------------------+
|    Error      |     Error     |      Error      |        RRR       |                                |
+-----------------------------------------------------------------------------------------------------+

*/

class COM{
	public:
		void Init();
	
		void Decoder(); //译码并执行
		void Print(char *data); //发送字符串
		void Tx_num(u32 data); //发送ASCII编码数字
	
		u8 Buffer[24];
		u8 TempBuffer[24]; //接收缓存
		
		bool RxFinish; //接收完成标志
		u8 DataCounter;
		u8 DataNumber;

		bool VerifyError; //校验错误标志
	
		bool TestAddress(); //地址检验	
	private:
		void Tx(u8); 
		u32 C2Q(u8 *data);

};

extern class COM Serial;
