#include "stm32f10x.h"
/*
//变长指令，结束符\n
//起始符%
//地址符CCC
+---------------------------------------------------------------------------------------------+
|   Operator    |        Operand        |      Return      |             Function             |
+---------------------------------------------------------------------------------------------+
|    GETCOM     |                       |       Com        |       Get Buffered Command       |
|---------------------------------------------------------------------------------------------|
|    SETSTA     |          Data         |       DDD        |   Set Info of Console StatusBar  |
|---------------------------------------------------------------------------------------------|
|    SETINF     |          Data         |       DDD        |      Set Info of InfoDisplay     |
|---------------------------------------------------------------------------------------------|
|    SETDAT     |          Data         |       DDD        |Show Data in Console and Continue |
|---------------------------------------------------------------------------------------------|
|    HLDDAT     |          Data         |       DDD        | Show Data in Console and Holding |
|---------------------------------------------------------------------------------------------|
|    WAITIN     |                       |       DDD        |    Set Sleep Time of Console     |
|---------------------------------------------------------------------------------------------|
|    ADDDIC     |          Data         |       DDD        |    Adding Data to Dictionary     |
|---------------------------------------------------------------------------------------------|
|    GETSWA     |                       |     OOO/FFF      |      Get Status of SwitchA       |
|---------------------------------------------------------------------------------------------|
|    GETSWB     |                       |     OOO/FFF      |      Get Status of SwitchB       |
+---------------------------------------------------------------------------------------------+
|   Unknown     |        Unknown        |       NNN        |                                  |
+---------------------------------------------------------------------------------------------+
|    Error      |         Error         |       RRR        |                                  |
+---------------------------------------------------------------------------------------------+

*/

class COM{
	public:
		void Init();
	
		void Decoder(); //译码并执行
		void Print(char *data); //发送字符串
	
		u8 Buffer[256]; //接收缓存
		u8 RxData[256]; //辅助接受缓存
		bool RxFinish; //接收完成标志
		u32 DataCounter; //数据量
		u32 DataNumber; //总数据量
	
		bool VerifyError; //校验错误标志
	
		bool TestAddress(); //地址检验
		
		bool Compare(char StrA[],char StrB[]);
	
		u32 Chr2Int(u8 *Data);
	
		void Tx(u8); 

	
};

extern class COM Serial;
	
